<a href="https://colab.research.google.com/github/btramduong0810/dsc-mod-1-project-v2-1-online-ds-sp-000/blob/master/Data_Science_in_Action_The_Movie_Industry.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Final Project Submission

* Student name: **BAO TRAM DUONG**
* Student pace: **SELF-PACED DATA SCIENCE PROGRAM**
* Scheduled project review date/time: 
* Instructor name: **JEFF HERMAN**
* Blog post URL:

# **Table of Contents**

**1.  Introduction**

1.1  Business Statement

1.2  The Approach

1.3  Data Sources

1.4  Methodology

**2.  Data Preparation**

2.1  Data reading

2.2  Data cleaning

2.3  Joining the dataframes and save as a seperated notebook

**3.  Data Visualization**

3.1  Budget

3.2  Runtime

3.3  Genre

3.4a  Release time: date

3.4b  Release time: month

3.4c  Release time: day

**4.  Conclusion and Future Work**

4.1  Summary of Findings

4.2  Actionable Insights

4.3  Future Works

## **1. INTRODUCTION**

### **1.1 Business Statement**

Microsoft sees all the big companies creating original video content, and they want to get in on the fun. They have decided to create a new movie studio, but the problem is they don’t know anything about creating movies. They have hired a team of data scientist from Flatiron to help them better understand the movie industry. The team is charged with doing data analysis and creating a presentation that explores what type of films are currently doing the best at the box office. The team must then translate those findings into actionable insights that the CEO can use when deciding what type of films they should be creating.

What makes a movie succesful and how do we create the next blockbuster movie that can return the highest ROI possible?

### **1.2 Our Approach**

We will explore the characteristics of a successful movie with a few selected ones:

1. Production budget
2. Genre
3. Runtime
4. Rating
5. Release date

### **1.3 Data Sources**

Data for this project was obtained from the following repository and also saved in ZippedData folder in this repository.

The data comes from:

1.   Box Office Mojo
2.   IMDB
3.   Rotten Tomatoes
4.   TheMovieDB.org

### **1.4 Methodology**

Data Cleaning and Preparation using Pandas and Numpy packages:

1. Importing libraries

2. Reading and cleaning provided data

3. Dealing with missing values

4. Joining datasets to create one main dataframe and save it as a seperated file

Data Visualization using Matplotlib and Seaborn packages:

1. Creating visualisations 

2. Drawing conclusions from results

3. Providing insights and recommendations

## **2. DATA PREPARATION**

### 2.1 Data Reading

First, import all required packages:

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

/Users/baotramduong8/opt/anaconda3/envs/learn-env/lib/python3.6/site-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

From a glance, we see that we have many files to go through. Let's use glob() to retrieve all the file paths:

In [2]:
#the glob module is used to retrieve files/pathnames matching a specified pattern
from glob import glob

In [3]:
# Create a list of all .csv files using glob()
csv_files = glob("./zippedData/*.csv.gz")
csv_files

['./zippedData/imdb.title.crew.csv.gz',
 './zippedData/tmdb.movies.csv.gz',
 './zippedData/imdb.title.akas.csv.gz',
 './zippedData/imdb.title.ratings.csv.gz',
 './zippedData/imdb.name.basics.csv.gz',
 './zippedData/imdb.title.basics.csv.gz',
 './zippedData/tn.movie_budgets.csv.gz',
 './zippedData/bom.movie_gross.csv.gz',
 './zippedData/imdb.title.principals.csv.gz']

In [4]:
len(csv_files) #we need to go through 9 .csv files

9

In [5]:
# Create a list of all tsv files using glob
tsv_files = glob("./zippedData/*.tsv.gz")
tsv_files

['./zippedData/rt.reviews.tsv.gz', './zippedData/rt.movie_info.tsv.gz']

In [6]:
len(tsv_files) #and 2 .tsv files

2

As we will see, there are a lot of information to go through. However, because of the time constraint and for the scope of this project, I will selectively pick and choose just a few features to do analysis on.

**Create dataframes from provided data**

In [196]:
#Create dataframe
movies_df = pd.read_csv('./zippedData/tmdb.movies.csv.gz') #selected
movies_df.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [197]:
#Create dataframe
title_rating_df = pd.read_csv('./zippedData/imdb.title.ratings.csv.gz') #selected
title_rating_df.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

**title_rating_df** and **movies_df** are selected for 'original_language', 'popularity', 'vote_average' and 'vote_count'

Positive word of mouth has an enormous effect on the success of the movie. It's not just how positive the reviews are but also the number of reviews that can predict box office success. We can use the movie_df and title_rating below to observe the correlation between vote_count, vote_average and genres to see which genre has the highest attention from the audience. It also includes release date, which is also an important factor contributing to the movie success i.e. the timing and appropriateness of its release schedule.

In [236]:
#Create dataframe
movie_budgets_df = pd.read_csv('./zippedData/tn.movie_budgets.csv.gz') #selected
movie_budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [199]:
#Create dataframe
movie_gross_df = pd.read_csv('./zippedData/bom.movie_gross.csv.gz') #selected
movie_gross_df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

When it comes to box office dollars, the recipe for a successful movie is pretty simple: small budget + massive ticket sales = huge profit! Hence, we will utilize the **movie_budgets_df** and **movie_gross_df** to do further analysis on them.

In [200]:
#Create dataframe
title_basics_df = pd.read_csv('./zippedData/imdb.title.basics.csv.gz') #selected
title_basics_df.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

Features that are worth investigating are 'genre', 'realease date and 'runtime'. We will pick **title_basics_df** to work with.

**As mentioned above, many things are outside the scope of this project. We will not use these dataframes below:**

In [282]:
#Create dataframe
title_crew_df = pd.read_csv('./zippedData/imdb.title.crew.csv.gz') #not selected
title_crew_df.head()

      tconst                      directors              writers
0  tt0285252                      nm0899854            nm0899854
1  tt0438973                            NaN  nm0175726,nm1802864
2  tt0462036                      nm1940585            nm1940585
3  tt0835418                      nm0151540  nm0310087,nm0841532
4  tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

In [283]:
#Create dataframe
name_basics_df = pd.read_csv('./zippedData/imdb.name.basics.csv.gz') #not selected
name_basics_df.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

In [284]:
#Create dataframe
title_aka_df = pd.read_csv('./zippedData/imdb.title.akas.csv.gz') #not selected
title_aka_df.head()

,title_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
1,tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
4,tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

In [285]:
#Create dataframe
title_principals_df = pd.read_csv('./zippedData/imdb.title.principals.csv.gz') #not selected
title_principals_df.head()

      tconst  ordering     nconst  category       job        characters
0  tt0111414         1  nm0246005     actor       NaN       ["The Man"]
1  tt0111414         2  nm0398271  director       NaN               NaN
2  tt0111414         3  nm3739909  producer  producer               NaN
3  tt0323808        10  nm0059247    editor       NaN               NaN
4  tt0323808         1  nm3579312   actress       NaN  ["Beth Boothby"]

In [201]:
#Create dataframe
movie_info_df = pd.read_table('./zippedData/rt.movie_info.tsv.gz', delimiter = '\t', encoding = 'latin-1') #not selected
movie_info_df.head()

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN

In [202]:
#Create dataframe
reviews_df = pd.read_table('./zippedData/rt.reviews.tsv.gz', delimiter = '\t', encoding = 'latin-1') #not selected
reviews_df.head()

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"

### 2.2 Data Cleaning

1. Remove duplicates or irrelevant observations
2. Handle misisng data
3. Filter unwanted outliers

### 2.2a Production budget and gross

First investigate the budget and gross since this is the purpose of this project is to make money. Let's see our data once more time:

**movie_budgets_df**

We are interested 'release_date', 'movie', 'production_budget', 'domestic_gross', and 'worldwide_gross'

In [237]:
#look at dataset again
movie_budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [238]:
#data summary
movie_budgets_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [239]:
#check for duplicates
movie_budgets_df.duplicated().any()

False

In [240]:
#check for null values
movie_budgets_df.isnull().any()

id                   False
release_date         False
movie                False
production_budget    False
domestic_gross       False
worldwide_gross      False
dtype: bool

This dataframe looks good: no missing data, no duplicates. 
1. We don't need the 'id' column so we are going to drop that. 
2. We will also check to see if release_date is a datetime object and will handle it accordingly.
3. Drop the '$' and ',' from 'production_budget', 'domestic_gross', and 'worldwide_gros' and also convert them into integer.

In [241]:
#drop 'id' column
movie_budgets_df = movie_budgets_df.drop('id', axis = 1)
movie_budgets_df.head(2)

,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"

In [242]:
movie_budgets_df['release_date'][0]

'Dec 18, 2009'

In [243]:
#check to see if release_date is a datetime object
import datetime
isinstance(movie_budgets_df['release_date'][0], datetime.date)

False

In [244]:
#convert release_date to a datetime object
movie_budgets_df['release_date'] = pd.to_datetime(movie_budgets_df['release_date'])

In [245]:
#check again
isinstance(movie_budgets_df['release_date'][0], datetime.date)

True

In [246]:
#check for the money values and convert them to integer if needed
print(type(movie_budgets_df['production_budget'][0]))
print(type(movie_budgets_df['domestic_gross'][0]))
print(type(movie_budgets_df['worldwide_gross'][0]))

<class 'str'>
<class 'str'>
<class 'str'>

In [247]:
#delete '$' and ',' and convert to int
def dollar_clean(dataframe, col):
    dataframe[col] = dataframe[col].str.replace('$', '').str.replace(',', '').astype('int')
    return dataframe

In [248]:
#apply dollar_clean function to the 3 columns
dollar_clean(movie_budgets_df, 'production_budget')
dollar_clean(movie_budgets_df, 'domestic_gross')
dollar_clean(movie_budgets_df, 'worldwide_gross')

,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,2009-12-18,Avatar,425000000,760507625,2776345279
1,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875
2,2019-06-07,Dark Phoenix,350000000,42762350,149762350
3,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963
4,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747
...,...,...,...,...,...
5777,2018-12-31,Red 11,7000,0,0
5778,1999-04-02,Following,6000,48482,240495
5779,2005-07-13,Return to the Land of Wonders,5000,1338,1338
5780,2015-09-29,A Plague So Pleasant,1400,0,0
5781,2005-08-05,My Date With Drew,1100,181041,181041

In [249]:
#obtain summary statistics
movie_budgets_df.describe()

       production_budget  domestic_gross  worldwide_gross
count       5.782000e+03    5.782000e+03     5.782000e+03
mean        3.158776e+07    4.187333e+07     9.148746e+07
std         4.181208e+07    6.824060e+07     1.747200e+08
min         1.100000e+03    0.000000e+00     0.000000e+00
25%         5.000000e+06    1.429534e+06     4.125415e+06
50%         1.700000e+07    1.722594e+07     2.798445e+07
75%         4.000000e+07    5.234866e+07     9.764584e+07
max         4.250000e+08    9.366622e+08     2.776345e+09

In [250]:
#create 'year' column
movie_budgets_df['release_year'] = pd.DatetimeIndex(movie_budgets_df['release_date']).year

In [251]:
movie_budgets_df.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year
0,2009-12-18,Avatar,425000000,760507625,2776345279,2009
1,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011
2,2019-06-07,Dark Phoenix,350000000,42762350,149762350,2019
3,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,2015
4,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,2017

**movies_gross_df**

In [252]:
#see the data again
movie_gross_df.head()

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010

In [253]:
movie_gross_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

In [254]:
movie_gross_df.isnull().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

There are a lot of missing values in 'domestic_gross' and 'foreign_gross' but we won't be using these columns anyways. We will drop them.

In [255]:
movie_gross_df = movie_gross_df.drop(['domestic_gross', 'foreign_gross', 'year'], axis = 1)

In [256]:
movie_gross_df.head()

                                         title studio
0                                  Toy Story 3     BV
1                   Alice in Wonderland (2010)     BV
2  Harry Potter and the Deathly Hallows Part 1     WB
3                                    Inception     WB
4                          Shrek Forever After   P/DW

In [257]:
(movie_gross_df['studio'].isnull().sum() / len(movie_gross_df) * 100).round(2)

0.15

Missing values in 'studio' is not significant, we will safely drop them

In [258]:
movie_gross_df = movie_gross_df.dropna()

In [259]:
#check again
movie_gross_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3382 entries, 0 to 3386
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   title   3382 non-null   object
 1   studio  3382 non-null   object
dtypes: object(2)
memory usage: 79.3+ KB

In [260]:
#rename column
movie_gross_df = movie_gross_df.rename(columns={'title':'movie'})
movie_gross_df.head(2)

                        movie studio
0                 Toy Story 3     BV
1  Alice in Wonderland (2010)     BV

Merging **movie_budgets_df** and **movie_gross_df** using 'movie'

In [300]:
#merging
movie_budget_gross_df = pd.merge(movie_budgets_df, movie_gross_df, on='movie')
movie_budget_gross_df.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross,release_year,studio
0,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,2011,BV
1,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,2015,BV
2,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,2018,BV
3,2017-11-17,Justice League,300000000,229024295,655945209,2017,WB
4,2015-11-06,Spectre,300000000,200074175,879620923,2015,Sony

In [262]:
len(movie_budget_gross_df)

1246

### 2.2 b Popularity: Rating and Number of Votes

**movies_df**

In [263]:
#let see the dataframe again
movies_df.head()

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186

In [264]:
#drop unnescessary columns
movies_df = movies_df.drop(['Unnamed: 0', 'genre_ids', 'id', 'original_title'], axis = 1)

In [265]:
movies_df.head()

,original_language,popularity,release_date,title,vote_average,vote_count
0,en,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,en,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,en,28.515,2010-05-07,Iron Man 2,6.8,12368
3,en,28.005,1995-11-22,Toy Story,7.9,10174
4,en,27.920,2010-07-16,Inception,8.3,22186

In [266]:
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   original_language  26517 non-null  object
 1   popularity         26517 non-null  float64
 2   release_date       26517 non-null  object
 3   title              26517 non-null  object
 4   vote_average       26517 non-null  float64
 5   vote_count         26517 non-null  int64
dtypes: float64(2), int64(1), object(3)
memory usage: 1.2+ MB

In [267]:
#check to see if release_date is datetime object
import datetime
isinstance(movies_df['release_date'][0], datetime.date)

False

In [268]:
#convert release_date to datetime object
movies_df['release_date'] = pd.to_datetime(movies_df['release_date'])

In [269]:
#check again
isinstance(movies_df['release_date'][0], datetime.date)

True

In [270]:
movies_df.isnull().any()

original_language    False
popularity           False
release_date         False
title                False
vote_average         False
vote_count           False
dtype: bool

This dataframe looks good: no missing data and datatype is correct

In [271]:
#check for duplicates
movies_df['title'].duplicated().sum()

1829

In [272]:
print(f'We have {len(movies_df)} title values in our dataset and there are {movies_df.title.nunique()} unique titlez')

We have 26517 title values in our dataset and there are 24688 unique titlez

In [273]:
#show duplicates
duplicates = movies_df[movies_df.duplicated(subset = "title")]
duplicates.head(20)

,original_language,popularity,release_date,title,vote_average,vote_count
781,en,2.235,2010-01-03,Brotherhood,6.2,31
1037,tl,1.504,2009-06-01,Boy,7.5,2
1230,en,1.241,2010-09-25,All That Glitters,10.0,1
1501,en,0.840,2010-02-06,Zero,5.8,6
1708,en,0.624,2010-01-01,The Gift,9.0,1
2081,en,0.600,2010-01-01,Alice in Wonderland,6.0,1
2290,en,0.600,2010-07-31,Lies Between Friends,4.8,4
2473,en,28.005,1995-11-22,Toy Story,7.9,10174
2477,en,22.698,1999-11-24,Toy Story 2,7.5,7553
2536,en,13.459,2010-12-10,TRON: Legacy,6.3,4387
2560,en,12.254,2011-04-08,Your Highness,5.3,735
2601,en,10.730,2011-08-17,The Awakening,6.4,782
2673,en,8.994,2010-12-29,Blue Valentine,6.9,1677
2717,en,8.319,2010-09-01,Rubber,5.9,417
2803,en,7.357,2011-01-14,Barney's Version,7.2,210
2854,en,6.667,2011-10-29,Zombie Apocalypse,4.4,56
2901,en,6.136,2011-03-16,Detention,5.6,206
2919,en,5.938,2011-05-13,Skateland,5.4,16
2946,es,5.552,2011-08-19,The Last Circus,6.7,177
2956,en,5.444,2011-07-15,Lucky,4.9,38

In [274]:
len(duplicates)

1829

In [275]:
#check to see if duplicates are remakes of each other
duplicates[duplicates['title'] == 'Brotherhood']

,original_language,popularity,release_date,title,vote_average,vote_count
781,en,2.235,2010-01-03,Brotherhood,6.2,31
18130,en,4.191,2016-09-08,Brotherhood,6.1,54

In [276]:
duplicates[duplicates['title'] == 'Boy']

,original_language,popularity,release_date,title,vote_average,vote_count
1037,tl,1.504,2009-06-01,Boy,7.5,2
5404,en,7.759,2012-03-02,Boy,7.5,149
12991,da,0.718,2014-06-20,Boy,6.0,4

In [277]:
duplicates[duplicates['title'] == 'The Gift']

,original_language,popularity,release_date,title,vote_average,vote_count
1708,en,0.624,2010-01-01,The Gift,9.0,1
13792,en,0.600,2014-07-26,The Gift,5.8,6
14275,en,12.097,2015-08-07,The Gift,6.7,1797
16400,en,0.631,2015-06-19,The Gift,9.0,1

## To do list: 
1. ask Jeff, 
2. then drop release_date, 
3. and rename 'title' to 'movie'

**title_rating_df**

In [278]:
#Let's see the dataframe again
title_rating_df.head()

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [279]:
title_rating_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

In [280]:
title_rating_df.isnull().any()

tconst           False
averagerating    False
numvotes         False
dtype: bool

In [281]:
title_rating_df.duplicated().any()

False

This dataframe looks good: no missing value, no duplicates, and the datatypes are correct: averagerating as float and numvotes as integer.

**title_basics_df**

In [282]:
title_basics_df.head()

,tconst,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [283]:
title_basics_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 6 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   primary_title    146144 non-null  object
 2   original_title   146123 non-null  object
 3   start_year       146144 non-null  int64
 4   runtime_minutes  114405 non-null  float64
 5   genres           140736 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 6.7+ MB

In [284]:
title_basics_df.duplicated().any()

False

In [285]:
title_basics_df.isnull().any()

tconst             False
primary_title      False
original_title      True
start_year         False
runtime_minutes     True
genres              True
dtype: bool

In [286]:
title_basics_df.isnull().sum()

tconst                 0
primary_title          0
original_title        21
start_year             0
runtime_minutes    31739
genres              5408
dtype: int64

There is no duplicates in this dataframe but there are a lot of missing values in runtime_minutes, which is of our interest.

In [287]:
#calculate how big a percentage of the missing values in 'runtime_minutes' from the whole dataset is
((title_basics_df['runtime_minutes'].isnull().sum()) / (len(title_basics_df)) * 100).round(2)

21.72

21.71% is a big portion hence we cannot safely ignore or discard it. Let's check out its summary statistics

In [288]:
title_basics_df['runtime_minutes'].describe()

count    114405.000000
mean         86.187247
std         166.360590
min           1.000000
25%          70.000000
50%          87.000000
75%          99.000000
max       51420.000000
Name: runtime_minutes, dtype: float64

Both median and mean are quite close so we can pick either one. Let's go with median.

In [289]:
#fill missing values with median value
title_basics_df['runtime_minutes'] = title_basics_df['runtime_minutes'].fillna(title_basics_df['runtime_minutes'].median())

In [290]:
#check again
title_basics_df['runtime_minutes'].isnull().any()

False

In [291]:
#calculate how big a percentage of the missing values in 'original_title' from the whole dataset is
((title_basics_df['original_title'].isnull().sum()) / (len(title_basics_df)) * 100).round(2)

0.01

This is a very small percentage so we can drop it.

In [292]:
#calculate how big a percentage of the missing values in 'genres' from the whole dataset is
((title_basics_df['genres'].isnull().sum()) / (len(title_basics_df)) * 100).round(2)

3.7

This is also a very small percentage so we will drop it too.

In [293]:
#drop null values
title_basics_df = title_basics_df.dropna()

In [294]:
#check again
title_basics_df.isnull().any()

tconst             False
primary_title      False
original_title     False
start_year         False
runtime_minutes    False
genres             False
dtype: bool

In [295]:
#rename 'primary_title' to 'movie' to be consistent with our main dataframe
title_basics_df = title_basics_df.rename(columns={'primary_title':'movie'})
title_basics_df.head()

,tconst,movie,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,87.0,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"

In [296]:
#drop 'original_title' because it's redundant
title_basics_df = title_basics_df.drop('original_title', axis = 1)
title_basics_df.head()

,tconst,movie,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,2018,87.0,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,2017,80.0,"Comedy,Drama,Fantasy"

In [297]:
#drop 'start_year' because it's redundant
title_basics_df = title_basics_df.drop('start_year', axis = 1)
title_basics_df.head()

,tconst,movie,runtime_minutes,genres
0,tt0063540,Sunghursh,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,122.0,Drama
3,tt0069204,Sabse Bada Sukh,87.0,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,80.0,"Comedy,Drama,Fantasy"

Merging **title_rating_df** and **title_basics_df** by 'tconst' which is an alphanumeric unique identifier of the title

In [298]:
#merge using 'tconst'
title_rating_basics_df = pd.merge(title_rating_df, title_basics_df, on=['tconst'])
title_rating_basics_df.head()

,tconst,averagerating,numvotes,movie,runtime_minutes,genres
0,tt10356526,8.3,31,Laiye Je Yaarian,117.0,Romance
1,tt10384606,8.9,559,Borderless,87.0,Documentary
2,tt1042974,6.4,20,Just Inès,90.0,Drama
3,tt1043726,4.2,50352,The Legend of Hercules,99.0,"Action,Adventure,Fantasy"
4,tt1060240,6.5,21,Até Onde?,73.0,"Mystery,Thriller"

In [301]:
title_rating_basics_df = title_rating_basics_df.rename(columns={'averagerating': 'average_rating', 'numvotes':'num_votes'})
title_rating_basics_df.head(2)

,tconst,average_rating,num_votes,movie,runtime_minutes,genres
0,tt10356526,8.3,31,Laiye Je Yaarian,117.0,Romance
1,tt10384606,8.9,559,Borderless,87.0,Documentary

In [299]:
len(title_rating_basics_df)

73052

# Ask Jeff about how to deal with dup in movies_df before merging it with title_rating_basics_df

# Merging everything together

Let's now merge it all together **movie_budgets_df** and **title_rating_basics_df**

In [342]:
#first check for size
title_rating_basics_df.shape

(73052, 6)

In [343]:
movie_budgets_df.shape

(5782, 5)

There is a big difference between 2 dataframes so we are expecting some data downside when merging.

In [356]:
#merge using 'movie'
big_df = pd.merge(movie_budgets_df, title_rating_basics_df, on='movie')

In [358]:
#preview
big_df.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross,tconst,averagerating,numvotes,runtime_minutes,genres
0,2009-12-18,Avatar,425000000,760507625,2776345279,tt1775309,6.1,43,93.0,Horror
1,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,tt1298650,6.6,447624,136.0,"Action,Adventure,Fantasy"
2,2019-06-07,Dark Phoenix,350000000,42762350,149762350,tt6565702,6.0,24451,113.0,"Action,Adventure,Sci-Fi"
3,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,tt2395427,7.3,665594,141.0,"Action,Adventure,Sci-Fi"
4,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,tt4154756,8.5,670926,149.0,"Action,Adventure,Sci-Fi"

In [359]:
#check for size
big_df.shape

(2867, 10)

In [360]:
#drop 'tconst' because we don't need it anymore
big_df = big_df.drop('tconst', axis = 1)
big_df.head()

,release_date,movie,production_budget,domestic_gross,worldwide_gross,averagerating,numvotes,runtime_minutes,genres
0,2009-12-18,Avatar,425000000,760507625,2776345279,6.1,43,93.0,Horror
1,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,6.6,447624,136.0,"Action,Adventure,Fantasy"
2,2019-06-07,Dark Phoenix,350000000,42762350,149762350,6.0,24451,113.0,"Action,Adventure,Sci-Fi"
3,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1403013963,7.3,665594,141.0,"Action,Adventure,Sci-Fi"
4,2018-04-27,Avengers: Infinity War,300000000,678815482,2048134200,8.5,670926,149.0,"Action,Adventure,Sci-Fi"

In [361]:
#save our clean dataframe
big_df.to_csv('big_df')

# **3. DATA VISUALIZATION**

# **4. CONCLUSION & FUTURE WORKS**

**Future works:**

Star quality, quality of script


There are other factors such as star quality, quality of script, special effects, marketing campaign, popularity of the film preceding it (if it's a sequel), competition or lack thereof, competition from non-movie events such as weather or news and sport events. 

Director and writer are also interesting to look at.

Movie researchers has also found that critics have a dual role, where they both influence consumers' movie choice and predict box office performance by reflecting moviegoers' tastes. Unfortunately we won't be investigating these features as they will take up extra time and are all outside the scope of this project.